linuxemb/MSP430/examples/EEM Examples/EEM_examples/AdvancedDebugging2.c


//***********************************************************
// Lab3f.c  Optimized code using 1.1MHz DCO/8 as MCLK and VLO as ACLK
//
// Green LED on LaunchPad should toggle about 30 times per second
//
// SFB 1/2012
//***********************************************************

#include <msp430g2553.h>

#ifndef TIMER0_A1_VECTOR
#define TIMER0_A1_VECTOR    TIMERA1_VECTOR
#define TIMER0_A0_VECTOR    TIMERA0_VECTOR
#endif
volatile long tempRaw;

void FaultRoutine(void);



void Delay(unsigned int Value)
{
   volatile unsigned int j = 0;

   for(j=Value; j>0; j--);
}



void main(void)
{
  WDTCTL = WDTPW + WDTHOLD;                 // Stop watchdog timer

  P1DIR = 0x41;                             // P1.0 & 6 output (red/green LEDs)
  P1OUT = 0;                                // LEDs off

if (CALBC1_1MHZ ==0xFF || CALDCO_1MHZ == 0xFF)
   FaultRoutine();		            // If calibration data is erased
 				            // run FaultRoutine()
  BCSCTL1 = CALBC1_1MHZ; 		    // Set range
  DCOCTL = CALDCO_1MHZ;  		    // Set DCO step + modulation

  BCSCTL3 |= LFXT1S_2;                      // LFXT1 = VLO
  IFG1 &= ~OFIFG;                           // Clear OSCFault flag
  BCSCTL2 |= SELM_0 + DIVM_3;               // MCLK = DCO/8

  
  
  while(1)
  {
    
   /* Configure ADC Temp Sensor Channel */
  ADC10CTL1 = INCH_10 + ADC10DIV_0;         // Temp Sensor ADC10CLK/4
  ADC10CTL0 = SREF_1 + ADC10SHT_3 + REFON + ADC10ON; //  + ADC10IE;
  //__delay_cycles(1000);   
   Delay(1000);// Wait for ADC Ref to settle  
  ADC10CTL0 |= ENC + ADC10SC;               // Sampling and conversion start
  

    
    P1OUT = 0x40; 			    // green LED on
   //_delay_cycles(100);
    Delay(5000);
      
 
    ADC10CTL0 &= ~ENC;
    ADC10CTL0 &= ~(REFON + ADC10ON);
    tempRaw = ADC10MEM;
    
    
    P1OUT = 0; 
    
    
    
    // green LED off
    
    
    Delay(5000);
    //_delay_cycles(5000);
  }
}

void FaultRoutine(void)
 {
   P1OUT = 0x01;                            // red LED on
   while(1); 			            // TRAP
 }









//////******************************************************************************
//////  MSP-FET430F16x - Test for Stack Overflow
//////
//////  Description; After a delay the function 'DummyStackFill' is called
//////  which places 100 Bytes on the Stack
//////
//////  Setup Breakpoint:
//////  - Open the Breakpoint menu (View | Breakpoints)
//////  - In the Breakpoints window, right-click and to open the context menu.
//////  - On the context menu, chose New Breakpoint | Conditional...
//////    - Breakpoint at: SP
//////    - Type: Register
//////    - Operator : <=
//////    - Access : Write
//////    - Action : Break
//////    - Condition:
//////      - Register Value: 0x950
//////
//////    Other fields: unchanged
//////    Close the dialog by clicking OK and execute the program
//////    -> Run
//////    -> the CPU will stop when the function 'DummyStackFill' is called
//////       because during the intialisation 100 words are pushed
//////       to the Stack and the Stackpointer will go below the set value of 0x950
//////
//////                   MSP430
//////             -----------------
//////         /|\|              XIN|-
//////          | |                 |
//////          --|RST          XOUT|-
//////            |                 |
//////            |             P1.0|-->LED (169)
//////            |             P5.1|-->LED (449)
//////
//////
//////  Texas Instruments, Inc
//////  June 2004
//////  Built with IAR Embedded Workbench Pro v3.20
//////
//////******************************************************************************
////
////
////#include  <msp430x16x.h>
////
////#define TRUE  (1==1)
////#define FALSE (!TRUE)
////
/////************************************************************
////* PMM - Power Management System for FRAM
////************************************************************/
////#define __MSP430_HAS_PMM_FRAM__       /* Definition to show that Module is available */
////#define __MSP430_BASEADDRESS_PMM_FRAM__ 0x0120
////#define PMM_BASE __MSP430_BASEADDRESS_PMM_FRAM__
////
////#define  PM5CTL0_              (0x0130u)  /* PMM Power Mode 5 Control Register 0 */
//////DEFCW(   PM5CTL0             , PM5CTL0_)
////
////#define PMMPW               (0xA500u)  /* PMM Register Write Password */
////#define PMMPW_H             (0xA5)    /* PMM Register Write Password for high word access */
////
/////* PMMCTL0 Control Bits */
////#define PMMSWBOR            (0x0004u)  /* PMM Software BOR */
////#define PMMSWPOR            (0x0008u)  /* PMM Software POR */
////#define PMMREGOFF           (0x0010u)  /* PMM Turn Regulator off */
////#define SVSHE               (0x0040u)  /* SVS high side enable */
////#define PMMLPRST            (0x0080u)  /* PMM Low-Power Reset Enable */
////
/////* PMMCTL0 Control Bits */
////#define PMMSWBOR_L          (0x0004u)  /* PMM Software BOR */
////#define PMMSWPOR_L          (0x0008u)  /* PMM Software POR */
////#define PMMREGOFF_L         (0x0010u)  /* PMM Turn Regulator off */
////#define SVSHE_L             (0x0040u)  /* SVS high side enable */
////#define PMMLPRST_L          (0x0080u)  /* PMM Low-Power Reset Enable */
////
/////* PMMIFG Control Bits */
////#define PMMBORIFG           (0x0100u)  /* PMM Software BOR interrupt flag */
////#define PMMRSTIFG           (0x0200u)  /* PMM RESET pin interrupt flag */
////#define PMMPORIFG           (0x0400u)  /* PMM Software POR interrupt flag */
////#define SVSHIFG             (0x2000u)  /* SVS low side interrupt flag */
////#define PMMLPM5IFG          (0x8000u)  /* LPM5 indication Flag */
////
/////* PMMIFG Control Bits */
////#define PMMBORIFG_H         (0x0001u)  /* PMM Software BOR interrupt flag */
////#define PMMRSTIFG_H         (0x0002u)  /* PMM RESET pin interrupt flag */
////#define PMMPORIFG_H         (0x0004u)  /* PMM Software POR interrupt flag */
////#define SVSHIFG_H           (0x0020u)  /* SVS low side interrupt flag */
////#define PMMLPM5IFG_H        (0x0080u)  /* LPM5 indication Flag */
////
/////* PM5CTL0 Power Mode 5 Control Bits */
////#define LOCKLPM5            (0x0001u)  /* Lock I/O pin configuration upon entry/exit to/from LPM5 */
////
/////* PM5CTL0 Power Mode 5 Control Bits */
////#define LOCKLPM5_L          (0x0001u)  /* Lock I/O pin configuration upon entry/exit to/from LPM5 */
////
////
////
////
////
////// Variable Defintions
////
////volatile unsigned int wLoopCounter = 0;             // Processing Loop Counter
////
////// Function Prototypes
////void Delay(unsigned int Value);
////
////int main(void)
////{
////  WDTCTL = WDTPW + WDTHOLD;   // Stop watchdog timer
////  P1OUT  = 0x00;              // init output
////  P1DIR |= 0x01;              // Set P1.0 to output direction
////  P5OUT  = 0x00;              // init output
////  P5DIR |= 0x02;              // Set P5.1 to output direction
////
////  TACTL = TASSEL_2 + MC_1;    // Run to CCR0 with SMCLK
////  TACCR0 = 1000;              //
////  TACCTL0 = CCIE;             // Enable CCR0 int.
////
////  _EINT();                    // Enable interrupts
////
////  while(TRUE)
////  {
////     PM5CTL0 &= ~LOCKLPM5;
////     wLoopCounter++;
////     P1OUT ^= 0x01;           // Toggle P1.0 using exclusive-OR
////     P5OUT ^= 0x02;           // Toggle P5.1 using exclusive-OR
////     Delay(10000);
////  }
////}
////
////void Delay(unsigned int Value)
////{
////   volatile unsigned int j = 0;
////
////   for(j=Value; j>0; j--);
////}
////
////
////void DummyStackFill(void)
////{
////       volatile unsigned int k[100]=0; // Local Variable is stored on the Stack
////                                       // -> 100 words are pushed to the Stack
////}
////
////
////#pragma vector=TIMERA0_VECTOR
////__interrupt void isr_TACCR0()
////{
////   static   unsigned int j=0;    // Entrance counter
////   j++;
////   if (j>5000)
////   {
////       DummyStackFill();
////       j = 0;
////   }
////}
////
//
///******************************************************************************
// *                  MSP-EXP430G2-LaunchPad User Experience Application
// * 
// * 1. Device starts up in LPM3 + blinking LED to indicate device is alive    
// *    + Upon first button press, device transitions to application mode
// * 2. Application Mode
// *    + Continuously sample ADC Temp Sensor channel, compare result against 
// *      initial value        
// *    + Set PWM based on measured ADC offset: Red LED for positive offset, Green
// *      LED for negative offset
// *    + Transmit temperature value via TimerA UART to PC  
// *    + Button Press --> Calibrate using current temperature  
// *                       Send character '°' via UART, notifying PC 
// * SFB 1/2012
// ******************************************************************************/
//  
//#include  "msp430g2553.h"
//
//#ifdef  TIMER0_A1_VECTOR
//#define TIMERA0_VECTOR (9 * 1u)
//#define TIMERA1_VECTOR (8 * 1u)
//#endif
//
//#define     LED0                  BIT0
//#define     LED1                  BIT6
//#define     LED_DIR               P1DIR
//#define     LED_OUT               P1OUT
//
//
// 
//#define     BUTTON                BIT3
//#define     BUTTON_OUT            P1OUT
//#define     BUTTON_DIR            P1DIR
//#define     BUTTON_IN             P1IN
//#define     BUTTON_IE             P1IE
//#define     BUTTON_IES            P1IES
//#define     BUTTON_IFG            P1IFG
//#define     BUTTON_REN            P1REN
//
//#define     TXD                   BIT1                      // TXD on P1.1
//#define     RXD                   BIT2                      // RXD on P1.2
//
//#define     APP_STANDBY_MODE      0
//#define     APP_APPLICATION_MODE  1
//
//#define     TIMER_PWM_MODE        0   
//#define     TIMER_UART_MODE       1
//#define     TIMER_PWM_PERIOD      2000  
//#define     TIMER_PWM_OFFSET      20
//
//#define     TEMP_SAME             0
//#define     TEMP_HOT              1
//#define     TEMP_COLD             2
//
//#define     TEMP_THRESHOLD        5  
//
////   Conditions for 9600/4=2400 Baud SW UART, SMCLK = 1MHz
//#define     Bitime_5              0x05*4                      // ~ 0.5 bit length + small adjustment
//#define     Bitime                13*4//0x0D    
// 
//#define     UART_UPDATE_INTERVAL  1000
//
//
//unsigned char BitCnt;
//
//
//unsigned char applicationMode = APP_STANDBY_MODE;
//unsigned char timerMode = TIMER_PWM_MODE;
//
//unsigned char tempMode;
//unsigned char calibrateUpdate = 0;
//unsigned char tempPolarity = TEMP_SAME;
//unsigned int TXByte;
//                               
///* Using an 8-value moving average filter on sampled ADC values */  
//long tempMeasured[8];
//unsigned char tempMeasuredPosition=0;
//long tempAverage;
//
//long tempCalibrated, tempDifference;
//
//
//  
//void InitializeLeds(void);
//void InitializeButton(void);
//void PreApplicationMode(void);                     // Blinks LED, waits for button press
//void ConfigureAdcTempSensor(void);
//void ConfigureTimerPwm(void);
//void ConfigureTimerUart(void);  
//void Transmit(void);
//void InitializeClocks(void);
//
//void main(void)
//{
//  unsigned int uartUpdateTimer = UART_UPDATE_INTERVAL;
//  unsigned char i;
//  WDTCTL = WDTPW + WDTHOLD;                 // Stop WDT
//  
//  InitializeClocks();
//  InitializeButton();
//  InitializeLeds();
//  PreApplicationMode();                     // Blinks LEDs, waits for button press
//  
//  /* Application Mode begins */
//  applicationMode = APP_APPLICATION_MODE;
//  ConfigureAdcTempSensor();
//  ConfigureTimerPwm();
//    
//  __enable_interrupt();                     // Enable interrupts.
//  
//  
//  /* Main Application Loop */
//  while(1)
//  {    
//    ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
//    __bis_SR_register(CPUOFF + GIE);        // LPM0 with interrupts enabled
//    
//    
//    /* Moving average filter out of 8 values to somewhat stabilize sampled ADC */
//    tempMeasured[tempMeasuredPosition++] = ADC10MEM;
//    if (tempMeasuredPosition == 8)
//      tempMeasuredPosition = 0;
//    tempAverage = 0;
//    for (i = 0; i < 8; i++)
//      tempAverage += tempMeasured[i];
//    tempAverage >>= 3;                      // Divide by 8 to get average
//    
//    if ((--uartUpdateTimer == 0) || calibrateUpdate )
//    {
//      ConfigureTimerUart();
//      if (calibrateUpdate)
//      { 
//        TXByte = 248;                       // A character with high value, outside of temp range 
//        Transmit();
//        calibrateUpdate = 0;
//      }   
//      TXByte = (unsigned char)( ((tempAverage - 630) * 761) / 1024 );      
//      Transmit(); 
//      uartUpdateTimer = UART_UPDATE_INTERVAL;
//      ConfigureTimerPwm();
//    }
//    
//    
//    tempDifference = tempAverage - tempCalibrated;
//    if (tempDifference < -TEMP_THRESHOLD)
//    {
//      tempDifference = -tempDifference;
//      tempPolarity = TEMP_COLD;
//      LED_OUT &= ~ LED1;
//    }
//    else
//    if (tempDifference > TEMP_THRESHOLD)
//    {
//      tempPolarity = TEMP_HOT;
//      LED_OUT &= ~ LED0;
//    }
//    else
//    {
//      tempPolarity = TEMP_SAME;
//      TACCTL0 &= ~CCIE;
//      TACCTL1 &= ~CCIE;
//      LED_OUT &= ~(LED0 + LED1);        
//    } 
//    
//    if (tempPolarity != TEMP_SAME)    
//    {      
//      tempDifference <<= 3;
//      tempDifference += TIMER_PWM_OFFSET;      
//      TACCR1 = ( (tempDifference) < (TIMER_PWM_PERIOD-1) ? (tempDifference) : (TIMER_PWM_PERIOD-1) );
//      TACCTL0 |= CCIE;
//      TACCTL1 |= CCIE;      
//    }   
//  }  
//}
//
//void PreApplicationMode(void)
//{    
//  LED_DIR |= LED0 + LED1;
//  LED_OUT |= LED0;                          // To enable the LED toggling effect
//  LED_OUT &= ~LED1;
//    
//  BCSCTL1 |= DIVA_1;                        // ACLK/2
//  BCSCTL3 |= LFXT1S_2;                      // ACLK = VLO
//  
//  TACCR0 = 1200;                             //   
//  TACTL = TASSEL_1 | MC_1;                  // TACLK = SMCLK, Up mode.  
//  TACCTL1 = CCIE + OUTMOD_3;                // TACCTL1 Capture Compare
//  TACCR1 = 600;  
//  __bis_SR_register(LPM3_bits + GIE);          // LPM0 with interrupts enabled
//}
//
//void ConfigureAdcTempSensor(void)
//{
//  unsigned char i;
//  /* Configure ADC Temp Sensor Channel */
//  ADC10CTL1 = INCH_10 + ADC10DIV_3;         // Temp Sensor ADC10CLK/4
//  ADC10CTL0 = SREF_1 + ADC10SHT_3 + REFON + ADC10ON + ADC10IE;
//  __delay_cycles(1000);                     // Wait for ADC Ref to settle  
//  ADC10CTL0 |= ENC + ADC10SC;               // Sampling and conversion start
//  __bis_SR_register(CPUOFF + GIE);          // LPM0 with interrupts enabled
//  tempCalibrated = ADC10MEM;
//  for (i=0; i < 8; i++)
//    tempMeasured[i] = tempCalibrated;
//  tempAverage = tempCalibrated;  
//}
//
//
//void ConfigureTimerPwm(void)
//{
//  timerMode = TIMER_PWM_MODE;
//  
//  TACCR0 = TIMER_PWM_PERIOD;                              //   
//  TACTL = TASSEL_2 | MC_1;                  // TACLK = SMCLK, Up mode.
//  TACCTL0 = CCIE;
//  TACCTL1 = CCIE + OUTMOD_3;                // TACCTL1 Capture Compare
//  TACCR1 = 1;
//}
//
//void ConfigureTimerUart(void)
//{
//  timerMode = TIMER_UART_MODE;               // Configure TimerA0 UART TX 
//                           
//  CCTL0 = OUT;                               // TXD Idle as Mark
//  TACTL = TASSEL_2 + MC_2 + ID_3;            // SMCLK/8, continuous mode
//  P1SEL |= TXD + RXD;                        //
//  P1DIR |= TXD;                              //  
//}
//
//// Function Transmits Character from TXByte 
//void Transmit()
//{ 
//  BitCnt = 0xA;                             // Load Bit counter, 8data + ST/SP
//  while (CCR0 != TAR)                       // Prevent async capture
//    CCR0 = TAR;                             // Current state of TA counter
//  CCR0 += Bitime;                     // Some time till first bit
//  TXByte |= 0x100;                        // Add mark stop bit to TXByte
//  TXByte = TXByte << 1;                 // Add space start bit
//  CCTL0 =  CCIS0 + OUTMOD0 + CCIE;          // TXD = mark = idle
//  while ( CCTL0 & CCIE );                   // Wait for TX completion
//}
//
//
//
//// Timer A0 interrupt service routine
//#pragma vector=TIMERA0_VECTOR
//__interrupt void Timer_A (void)
//{
//  if (timerMode == TIMER_UART_MODE)
//  {
//    CCR0 += Bitime;                           // Add Offset to CCR0  
//    if (CCTL0 & CCIS0)                        // TX on CCI0B?
//    {
//      if ( BitCnt == 0)
//        CCTL0 &= ~ CCIE;                        // All bits TXed, disable interrupt
//      else
//      {
//        CCTL0 |=  OUTMOD2;                    // TX Space
//        if (TXByte & 0x01)
//        CCTL0 &= ~ OUTMOD2;                   // TX Mark
//        TXByte = TXByte >> 1;
//        BitCnt --;
//      }
//    }
//  }
//  else
//  {
//    if (tempPolarity == TEMP_HOT)
//      LED_OUT |= LED1;   
//    if (tempPolarity == TEMP_COLD)      
//      LED_OUT |= LED0;
//    TACCTL0 &= ~CCIFG;              
//  }
//}
//
//#pragma vector=TIMERA1_VECTOR
//__interrupt void ta1_isr(void)
//{
//  TACCTL1 &= ~CCIFG;
//  if (applicationMode == APP_APPLICATION_MODE)
//    LED_OUT &= ~(LED0 + LED1);
//  else
//    LED_OUT ^= (LED0 + LED1);
//    
//}
//
//void InitializeClocks(void)
//{
//
//  BCSCTL1 = CALBC1_1MHZ;                    // Set range
//  DCOCTL = CALDCO_1MHZ;
//  BCSCTL2 &= ~(DIVS_3);                         // SMCLK = DCO / 8 = 1MHz  
//}
//
//void InitializeButton(void)                 // Configure Push Button 
//{
//  BUTTON_DIR &= ~BUTTON;
//  BUTTON_OUT |= BUTTON;
//  BUTTON_REN |= BUTTON;
//  BUTTON_IES |= BUTTON;
//  BUTTON_IFG &= ~BUTTON;
//  BUTTON_IE |= BUTTON;
//}
//
//
//void InitializeLeds(void)
//{
//  LED_DIR |= LED0 + LED1;                          
//  LED_OUT &= ~(LED0 + LED1);  
//}
//
///* *************************************************************
// * Port Interrupt for Button Press 
// * 1. During standby mode: to exit and enter application mode
// * 2. During application mode: to recalibrate temp sensor 
// * *********************************************************** */
//#pragma vector=PORT1_VECTOR
//__interrupt void PORT1_ISR(void)
//{   
//  BUTTON_IFG = 0;  
//  BUTTON_IE &= ~BUTTON;            /* Debounce */
//  WDTCTL = WDT_ADLY_250;
//  IFG1 &= ~WDTIFG;                 /* clear interrupt flag */
//  IE1 |= WDTIE;  
//    
//  if (applicationMode == APP_APPLICATION_MODE)
//  {
//    tempCalibrated = tempAverage;
//    calibrateUpdate  = 1;
//  }
//  else
//  {
//    applicationMode = APP_APPLICATION_MODE; // Switch from STANDBY to APPLICATION MODE
//    __bic_SR_register_on_exit(LPM3_bits);        
//  }   
//}
//
//#pragma vector=WDT_VECTOR
//__interrupt void WDT_ISR(void)
//{
//    IE1 &= ~WDTIE;                   /* disable interrupt */
//    IFG1 &= ~WDTIFG;                 /* clear interrupt flag */
//    WDTCTL = WDTPW + WDTHOLD;        /* put WDT back in hold state */
//    BUTTON_IE |= BUTTON;             /* Debouncing complete */
//}
//
//// ADC10 interrupt service routine
//#pragma vector=ADC10_VECTOR
//__interrupt void ADC10_ISR (void)
//{
//  __bic_SR_register_on_exit(CPUOFF);        // Return to active mode
//}
//
//
//
